In [3]:
import pandas as pd
import numpy as np

In [4]:
np.random.seed(101)

In [6]:
pd.Series()
np.random.rand(5,4)

array([[0.51639863, 0.57066759, 0.02847423, 0.17152166],
       [0.68527698, 0.83389686, 0.30696622, 0.89361308],
       [0.72154386, 0.18993895, 0.55422759, 0.35213195],
       [0.1818924 , 0.78560176, 0.96548322, 0.23235366],
       [0.08356143, 0.60354842, 0.72899276, 0.27623883]])

In [7]:
df1=pd.DataFrame(np.random.rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df1

          W         X         Y         Z
A  0.685306  0.517867  0.048485  0.137869
B  0.186967  0.994318  0.520665  0.578790
C  0.734819  0.541962  0.913154  0.807920
D  0.402998  0.357224  0.952877  0.343632
E  0.865100  0.830278  0.538161  0.922469

In [22]:
df1['B':'D']

          W         X         Y         Z
B  0.186967  0.994318  0.520665  0.578790
C  0.734819  0.541962  0.913154  0.807920
D  0.402998  0.357224  0.952877  0.343632

In [23]:
type(df1['W'])

pandas.core.series.Series

In [26]:
df1[['W','X','Y']] #For selecting multiple columns pass the column name to a list

          W         X         Y
A  0.685306  0.517867  0.048485
B  0.186967  0.994318  0.520665
C  0.734819  0.541962  0.913154
D  0.402998  0.357224  0.952877
E  0.865100  0.830278  0.538161

In [27]:
df1['new']=df1['W']**.5

In [28]:
df1

          W         X         Y         Z       new
A  0.685306  0.517867  0.048485  0.137869  0.827832
B  0.186967  0.994318  0.520665  0.578790  0.432397
C  0.734819  0.541962  0.913154  0.807920  0.857216
D  0.402998  0.357224  0.952877  0.343632  0.634821
E  0.865100  0.830278  0.538161  0.922469  0.930107

In [30]:
df1.drop('new',axis=1,inplace=True)#axis=0 is default which means rows. bcz df1.shape returs (rows,columns) by index it is (0,1)

In [46]:
df1['new']=np.sqrt(df1['W'])
df1

          W         X         Y         Z       new
A  0.685306  0.517867  0.048485  0.137869  0.827832
B  0.186967  0.994318  0.520665  0.578790  0.432397
C  0.734819  0.541962  0.913154  0.807920  0.857216
D  0.402998  0.357224  0.952877  0.343632  0.634821

In [35]:
df1.drop('D')

          W         X         Y         Z
A  0.685306  0.517867  0.048485  0.137869
B  0.186967  0.994318  0.520665  0.578790
C  0.734819  0.541962  0.913154  0.807920

In [36]:
df1.shape

(4, 4)

# Selecting rows

In [38]:
df1.loc['B'] #Labled location

W    0.186967
X    0.994318
Y    0.520665
Z    0.578790
Name: B, dtype: float64

In [39]:
df1.iloc[1] #Indexed location

W    0.186967
X    0.994318
Y    0.520665
Z    0.578790
Name: B, dtype: float64

In [43]:
df1.loc['B':'D','W':'Y'] #Subsetting. Passing specified columns and rows label

          W         X         Y
B  0.186967  0.994318  0.520665
C  0.734819  0.541962  0.913154
D  0.402998  0.357224  0.952877

In [44]:
df1.loc['B':'D',['W','X','Y']]

          W         X         Y
B  0.186967  0.994318  0.520665
C  0.734819  0.541962  0.913154
D  0.402998  0.357224  0.952877

# Single and multiple conditional selection

In [48]:
df1[df1>0.5]

          W         X         Y        Z       new
A  0.685306  0.517867       NaN      NaN  0.827832
B       NaN  0.994318  0.520665  0.57879       NaN
C  0.734819  0.541962  0.913154  0.80792  0.857216
D       NaN       NaN  0.952877      NaN  0.634821

In [49]:
df1['W']>0.5

A     True
B    False
C     True
D    False
Name: W, dtype: bool

In [58]:
df1[df1['W']>0.5 ]

          W         X         Y         Z       new
A  0.685306  0.517867  0.048485  0.137869  0.827832
C  0.734819  0.541962  0.913154  0.807920  0.857216

In [67]:
df1[df1['W']>0.5 ][['X','Y']]
df1.loc[:,'X':'Z']
df1[df1['W']>0.5].loc[:,'X':'new']

          X         Y         Z       new
A  0.517867  0.048485  0.137869  0.827832
C  0.541962  0.913154  0.807920  0.857216

In [57]:
df1.loc['A']>0.5

W       True
X       True
Y      False
Z      False
new     True
Name: A, dtype: bool

In [73]:
df1[(df1['W']>0.5) & (df1['X']>0.5)] #cannot use 'and'

          W         X         Y         Z       new
A  0.685306  0.517867  0.048485  0.137869  0.827832
C  0.734819  0.541962  0.913154  0.807920  0.857216

In [74]:
df1.reset_index() # Now old index becomes a column

  index         W         X         Y         Z       new
0     A  0.685306  0.517867  0.048485  0.137869  0.827832
1     B  0.186967  0.994318  0.520665  0.578790  0.432397
2     C  0.734819  0.541962  0.913154  0.807920  0.857216
3     D  0.402998  0.357224  0.952877  0.343632  0.634821

In [78]:
df1['country']='IN IT US UK'.split()
df1.set_index('country') #To replace the existing index

                W         X         Y         Z       new
country
IN       0.685306  0.517867  0.048485  0.137869  0.827832
IT       0.186967  0.994318  0.520665  0.578790  0.432397
US       0.734819  0.541962  0.913154  0.807920  0.857216
UK       0.402998  0.357224  0.952877  0.343632  0.634821

In [79]:
out='G1 G1 G1 G2 G2 G2'.split()
ins=[1,2,3,1,2,3]
hier_index=list(zip(out,ins))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [81]:
hier_index=pd.MultiIndex.from_tuples(hier_index) #Multi level index
hier_index[:]

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [83]:
df=pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.638787  0.329646
   2 -0.497104 -0.754070
   3 -0.943406  0.484752
G2 1 -0.116773  1.901755
   2  0.238127  1.996652
   3 -0.993263  0.196800

In [84]:
df.loc['G1'].loc[1]

A    0.638787
B    0.329646
Name: 1, dtype: float64

In [98]:
df.loc['G2'].loc[2,'B']

1.9966522853695665

In [90]:
df.index.names

FrozenList([None, None])

In [92]:
df.index.names=['Groups','Numbers']
df

                       A         B
Groups Numbers
G1     1        0.638787  0.329646
       2       -0.497104 -0.754070
       3       -0.943406  0.484752
G2     1       -0.116773  1.901755
       2        0.238127  1.996652
       3       -0.993263  0.196800

In [102]:
df.loc[['G1','G2']].loc[1]

KeyError: 'the label [1] is not in the [index]'

In [104]:
df.xs('G1') #cross section

                A         B
Numbers
1        0.638787  0.329646
2       -0.497104 -0.754070
3       -0.943406  0.484752

In [106]:
df.xs(1,level='Numbers') #To select row 1 of both groups

               A         B
Groups
G1      0.638787  0.329646
G2     -0.116773  1.901755

# Missing data handling

In [107]:
di={'A':[1,2,np.NaN],'B':[1,np.NaN,np.NaN],'C':[1,2,3]}

In [108]:
df=pd.DataFrame(di)
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# To drop missing values

In [109]:
df.dropna() #By default drops rows -use axis #By default drops all rows/columns containing a single NaN -use thresh

     A    B  C
0  1.0  1.0  1

In [110]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [111]:
df.dropna(thresh=2) #This means retain the rows that has minimum 2 not null values

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

# To fill/replace missing values

In [115]:
df.fillna(-1)

     A    B  C
0  1.0  1.0  1
1  2.0 -1.0  2
2 -1.0 -1.0  3

In [124]:
df.fillna(df.mean()) #REPLACE MISSING VALUE WITH MEAN

     A    B  C
0  1.0  1.0  1
1  2.0  1.0  2
2  1.5  1.0  3

In [125]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [126]:
dat={'Dep':['IT','IT','EEE','EEE','Mech','Mech'],'Student':['Santhosh','Gopi','Ramya','Mahesh','Venu','Sindhu'],'Scores':[180,144,193,172,129,195]}
df=pd.DataFrame(dat)
df

    Dep   Student  Scores
0    IT  Santhosh     180
1    IT      Gopi     144
2   EEE     Ramya     193
3   EEE    Mahesh     172
4  Mech      Venu     129
5  Mech    Sindhu     195

In [128]:
byDep=df.groupby('Dep')

In [129]:
byDep.mean() #Note: By default mean operation is performed on scores and not for Student, bcz Pandas Automaticaly uderstands student is a string column/series

      Scores
Dep
EEE    182.5
IT     162.0
Mech   162.0

In [131]:
byDep.sum().loc['IT']

Scores    324
Name: IT, dtype: int64

In [135]:
df.groupby('Dep').std().loc['Mech']

Scores    46.669048
Name: Mech, dtype: float64

In [136]:
df.groupby('Dep').count()

      Student  Scores
Dep
EEE         2       2
IT          2       2
Mech        2       2

In [137]:
df.groupby('Dep').min()

     Student  Scores
Dep
EEE   Mahesh     172
IT      Gopi     144
Mech  Sindhu     129

In [138]:
df.groupby('Dep').describe()

     Scores
      count   mean        std    min     25%    50%     75%    max
Dep
EEE     2.0  182.5  14.849242  172.0  177.25  182.5  187.75  193.0
IT      2.0  162.0  25.455844  144.0  153.00  162.0  171.00  180.0
Mech    2.0  162.0  46.669048  129.0  145.50  162.0  178.50  195.0

In [142]:
df.groupby('Dep').describe().transpose()[['IT','EEE']]

Dep                   IT         EEE
Scores count    2.000000    2.000000
       mean   162.000000  182.500000
       std     25.455844   14.849242
       min    144.000000  172.000000
       25%    153.000000  177.250000
       50%    162.000000  182.500000
       75%    171.000000  187.750000
       max    180.000000  193.000000

# Merge, join and concat

In [145]:
pd.concat([df,df]) #by default join axis is 0, rows

    Dep   Student  Scores
0    IT  Santhosh     180
1    IT      Gopi     144
2   EEE     Ramya     193
3   EEE    Mahesh     172
4  Mech      Venu     129
5  Mech    Sindhu     195
0    IT  Santhosh     180
1    IT      Gopi     144
2   EEE     Ramya     193
3   EEE    Mahesh     172
4  Mech      Venu     129
5  Mech    Sindhu     195

In [146]:
pd.concat([df,df],axis=1) #Jins based on index

    Dep   Student  Scores   Dep   Student  Scores
0    IT  Santhosh     180    IT  Santhosh     180
1    IT      Gopi     144    IT      Gopi     144
2   EEE     Ramya     193   EEE     Ramya     193
3   EEE    Mahesh     172   EEE    Mahesh     172
4  Mech      Venu     129  Mech      Venu     129
5  Mech    Sindhu     195  Mech    Sindhu     195

In [148]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [149]:
pd.merge(left,right,on=['key1','key2']) #By default inner join

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [153]:
#join function works on index
#left.join(right,on=['key1','key2'])

# Pandas operations

In [154]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [155]:
#Unique values

In [160]:
df['col2'].unique()
len(df['col2'].unique()) #length of unique values
df['col2'].nunique() #length of unique values

3

In [162]:
df['col2'].value_counts() #Countof each values

444    2
555    1
666    1
Name: col2, dtype: int64

In [163]:
df[(df['col1']>2) & (df['col2']==444)] # Conditional selection

   col1  col2 col3
3     4   444  xyz

# apply function

In [164]:
def doubleit(x):
    return x*2

In [178]:
df['col3'].sum() #Buil- in function and returns single value

df['col1'].apply(doubleit) #To broadcast (apply operation on eac element) user defined/built in functions use apply
#df['col3'].apply(len)
#len(df['col3'])

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [177]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [181]:
df.drop('col1',axis=1) #To remove rows and columns from data frame. Set inplace parameter

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [183]:
df.columns #These are attributes of dataframes
df.index

RangeIndex(start=0, stop=4, step=1)

In [187]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [188]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Pivot table

In [191]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df=pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [200]:
#df.pivot(columns=['A','B','C'])
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [201]:
pwd

'C:\\Users\\abkm\\Downloads\\Py-DS-ML-Bootcamp-master\\Refactored_Py_DS_ML_Bootcamp-master'

In [202]:
cd 'C:\Users\abkm\Downloads\Py-DS-ML-Bootcamp-master\Refactored_Py_DS_ML_Bootcamp-master\03-Python-for-Data-Analysis-Pandas'

[WinError 123] The filename, directory name, or volume label syntax is incorrect: "'C:\\Users\\abkm\\Downloads\\Py-DS-ML-Bootcamp-master\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'"
C:\Users\abkm\Downloads\Py-DS-ML-Bootcamp-master\Refactored_Py_DS_ML_Bootcamp-master

In [203]:
cd C:\Users\abkm\Downloads\Py-DS-ML-Bootcamp-master\Refactored_Py_DS_ML_Bootcamp-master\03-Python-for-Data-Analysis-Pandas

C:\Users\abkm\Downloads\Py-DS-ML-Bootcamp-master\Refactored_Py_DS_ML_Bootcamp-master\03-Python-for-Data-Analysis-Pandas

In [204]:
pwd

'C:\\Users\\abkm\\Downloads\\Py-DS-ML-Bootcamp-master\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [206]:
df=pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [207]:
df.to_csv('my_out.csv',index=False)

In [208]:
pd.read_csv('my_out.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [213]:
pd.read_excel('Excel_Sample.xlsx','Sheet1') #For excel each sheet is a data frame

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15